print('Ти бачиш печеру. Зайти? (так/ні)')
answer = input()
if answer == 'так':
    print('Ти зайшов у печеру. Там темно і страшно. Запалюєш смолоскип? (так/ні)')
    answer = input()
    if answer == 'так':
        print('Ти бачеш скриню. Відкриваєш її? (так/ні)')
        answer = input()
        if answer == 'так':
            print('Це пастка. Тебе зжерли монстри. Кінець гри.')
        else:
            print('Ти розумно пройшов далі.')
    else:
        print('Виходиш з печери.')
else:
    print('Ти вирішив не ризикувати і пішов далі.')